vlocity/DataRaptor/VPLExpectedMeterRangeXMLtoJSON/VPLExpectedMeterRangeXMLtoJSON_DataPack.json

{
    "BatchSize": 200,
    "Description": "",
    "ExpectedInputJson": "VPLExpectedMeterRangeXMLtoJSON_InputJson.json",
    "ExpectedInputOtherData": "",
    "ExpectedInputXml": "",
    "ExpectedOutputJson": "",
    "ExpectedOutputOtherData": "",
    "ExpectedOutputXml": "",
    "GlobalKey": "VPLExpectedMeterRangeXMLtoJSON",
    "InputParsingClass": "",
    "InputType": "XML",
    "IsAssignmentRulesUsed": false,
    "IsDeletedOnSuccess": false,
    "IsErrorIgnored": false,
    "IsFieldLevelSecurityEnabled": false,
    "IsNullInputsIncludedInOutput": false,
    "IsProcessSuperBulk": false,
    "IsRollbackOnError": false,
    "IsSourceObjectDefault": false,
    "IsXmlDeclarationRemoved": false,
    "Name": "VPLExpectedMeterRangeXMLtoJSON",
    "OmniDataTransformItem": "VPLExpectedMeterRangeXMLtoJSON_Items.json",
    "OutputParsingClass": "",
    "OutputType": "JSON",
    "OverrideKey": "",
    "PreprocessorClassName": "",
    "PreviewJsonData": "<? xml version=\"1.0\" ?>\n<soapenv:Envelope\nxmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\n    xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"\n    xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\">\n    <soapenv:Body>\n        <notifications\n            xmlns=\"http://soap.sforce.com/2005/09/outbound\">\n            <Notification>\n                <sObject\n                    xmlns:sf=\"urn:sobject.enterprise.soap.sforce.com\" xsi:type=\"sf:Account\">\n                    <sf:MeterReadingDate>03-20-2020\"</sf:MeterReadMonth1>\n                    <sf:Meter_Serial_Number__c>ISUMDG135410G</sf:Meter_Serial_Number__c>\n                    <sf:PROD_Utility_Type__c>Gas</sf:PROD_Utility_Type__c>\n                    <sf:ExpctedLowValue>11954</sf:ExpctedLowValue>\n                    <sf:ExpctedHighValue>12564</sf:ExpctedHighValue>\n                </sObject>\n\t\t\t\t<sObject\n                    xmlns:sf=\"urn:sobject.enterprise.soap.sforce.com\" xsi:type=\"sf:Account\">\n                    <sf:MeterReadingDate>04-20-2020</sf:MeterReadingDate>\n                    <sf:Meter_Serial_Number__c>ISU122223</sf:Meter_Serial_Number__c>\n                    <sf:PROD_Utility_Type__c>Water</sf:PROD_Utility_Type__c>\n                    <sf:ExpctedLowValue>12564</sf:ExpctedLowValue>\n                    <sf:ExpctedHighValue>13232</sf:ExpctedHighValue>\n                </sObject>\n            </Notification>\n            <OrganizationId>00Df2000000NVjK</OrganizationId>\n            <PartnerUrl>https: //accenture-utilities--UIDev.cs5.my.salesforce.com/services/Soap/u/41.0/00Df2000000NVjK</PartnerUrl>\n            <EnterpriseUrl>https: //accenture-utilities--UIDev.cs5.my.salesforce.com/services/Soap/c/41.0/00Df2000000NVjK</EnterpriseUrl>\n            <SessionId xsi:nil=\"true\"></SessionId>\n        </notifications>\n    </soapenv:Body>\n</soapenv:Envelope>",
    "PreviewOtherData": "",
    "PreviewSourceObjectData": "",
    "PreviewXmlData": "VPLExpectedMeterRangeXMLtoJSON_SampleInputXML.xml",
    "RequiredPermission": "",
    "ResponseCacheTtlMinutes": "",
    "ResponseCacheType": "",
    "SourceObject": "json",
    "SynchronousProcessThreshold": -1,
    "TargetOutputDocumentIdentifier": "",
    "TargetOutputFileName": "",
    "Type": "Transform",
    "VersionNumber": 1,
    "VlocityDataPackType": "SObject",
    "VlocityRecordSObjectType": "OmniDataTransform",
    "VlocityRecordSourceKey": "OmniDataTransform/VPLExpectedMeterRangeXMLtoJSON",
    "XmlOutputTagsOrder": ""
}