scripts/event-and-env-vars/start_workflow/event.json

{
    "body": "<?xml version='1.0' encoding='UTF-8'?>\n<soapenv:Envelope xmlns:soapenv='http: //schemas.xmlsoap.org/soap/envelope/' xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'>\n <soapenv:Body>\n  <notifications xmlns='http://soap.sforce.com/2005/09/outbound'>\n   <OrganizationId>00D2E000000oF5KUAU</OrganizationId>\n   <ActionId>04kTV000001AjCzYAK</ActionId>\n   <SessionId>00D2E000000oF5K!AQEAQP9TlqNJJBShABnOqgJQhBoG4whVfgAcSswicTUStptwukmncos0sLB4CS0_upbP6A6VuuvNYaczp65qS9FoAtU2b0gP</SessionId>\n   <EnterpriseUrl>https://shulman-hill.my.salesforce.com/services/Soap/c/61.0/00D2E000000oF5K</EnterpriseUrl>\n   <PartnerUrl>https://shulman-hill.my.salesforce.com/services/Soap/u/61.0/00D2E000000oF5K</PartnerUrl>\n   <Notification>\n    <Id>04lTV0000054X8zYAE</Id>\n    <sObject xsi:type='sf:Treatment_Custom__c' xmlns:sf='urn:sobject.enterprise.soap.sforce.com'>\n     <sf:Id>a32TV000000jJ6ZYAU</sf:Id>\n     <sf:File_Info_Id__c>a2VTV000001CG8T2AW</sf:File_Info_Id__c>\n     <sf:Record_Type_Name__c>Diagnostic Test</sf:Record_Type_Name__c>\n    </sObject>\n   </Notification>\n  </notifications>\n </soapenv:Body>\n</soapenv:Envelope>"
}